const questionBank = {
    "1.jpg": [
        { answers: ["单燕尾滑块座", "45", "1：2"] },
        { answers: ["左视图", "俯视图", "一"] },
        { answers: ["0.021", "10.036"] },
        { answers: ["2", "18"] },
        { answers: ["4", "12.5"] },
        { answers: ["对称度", "0.05", "B"] }
    ],
    "2.jpg": [
        { answers: ["阀盖", "HT150", "1:1"] },
        { answers: ["2", "主", "左", "全剖视图"] },
        { answers: ["垂直度", "Φ35孔的轴线", "0.02", "B"] },
        { answers: ["35", "35", "34.075", "0.025"] }
    ],
    "3.jpg": [
        { answers: ["皮带轮", "HT150", "1：1"] },
        { answers: ["2", "全"] },
        { answers: ["30.03", "30", "0.03"] },
        { answers: ["圆跳动", "0.03", "A"] },
        { answers: ["3.2", "6.3"] },
        { answers: ["8", "3.3"] }
    ],
    "4.jpg": [
        { answers: ["从动轴", "40Cr", "1：1"] },
        { answers: ["60.021", "60.002", "0.019"] },
        { answers: ["39", "12.5"] },
        { answers: ["圆跳动", "0.015", "A-B"] },
        { answers: ["调质", "245-265HBS"] },
        { answers: ["14", "5.5"] }
    ],
    "5.jpg": [
        { answers: ["机座", "1：2"] },
        { answers: ["45", "调质"] },
        { answers: ["局部"] },
        { answers: ["0.066", "68.056", "67.99"] },
        { answers: ["Φ13", "6"] },
        { answers: ["8", "6.3"] },
        { answers: ["垂直度", "0.06", "A"] }
    ],
    "6.jpg": [
        { answers: ["夹头", "45", "1：1"] },
        { answers: ["2", "半", "局部"] },
        { answers: ["60.05", "59.95", "0.1"] },
        { answers: ["垂直度", "Φ0.08", "A"] },
        { answers: ["1.6", "6.3"] },
        { answers: ["时效处理"] }
    ],
    "7.jpg": [
        { answers: ["端盖", "HT150", "1：1"] },
        { answers: ["2", "主", "左", "旋转"] },
        { answers: ["垂直度", "0.02", "A"] },
        { answers: ["16", "16.018", "16", "16.018"] },
        { answers: ["1.6"] }
    ],
    "8.jpg": [
        { answers: ["夹具体", "1：2"] },
        { answers: ["HT150"] },
        { answers: ["局部"] },
        { answers: ["100", "72"] },
        { answers: ["0.05", "62.025", "61.075"] },
        { answers: ["2", "15"] },
        { answers: ["6.3"] },
        { answers: ["垂直度", "Φ0.03", "A"] }
    ],
    "9.jpg": [
        { answers: ["2", "旋转", "1：1"] },
        { answers: ["支座", "HT200"] },
        { answers: ["1.6", "25"] },
        { answers: ["垂直度", "Φ65孔的轴线", "B", "Φ0.01"] },
        { answers: ["左端面"] },
        { answers: ["65", "65.030", "65"] }
    ]
};